GopalSaraf/Practicals/PSDL/include/proc/pic18f45k80.inc
// Register: RXFCON1
#define RXFCON1 RXFCON1
RXFCON1                                  equ 0E47h
// bitfield definitions
RXFCON1_RXF8EN_POSN                      equ 0000h
RXFCON1_RXF8EN_POSITION                  equ 0000h
RXFCON1_RXF8EN_SIZE                      equ 0001h
RXFCON1_RXF8EN_LENGTH                    equ 0001h
RXFCON1_RXF8EN_MASK                      equ 0001h
RXFCON1_RXF9EN_POSN                      equ 0001h
RXFCON1_RXF9EN_POSITION                  equ 0001h
RXFCON1_RXF9EN_SIZE                      equ 0001h
RXFCON1_RXF9EN_LENGTH                    equ 0001h
RXFCON1_RXF9EN_MASK                      equ 0002h
RXFCON1_RXF10EN_POSN                     equ 0002h
RXFCON1_RXF10EN_POSITION                 equ 0002h
RXFCON1_RXF10EN_SIZE                     equ 0001h
RXFCON1_RXF10EN_LENGTH                   equ 0001h
RXFCON1_RXF10EN_MASK                     equ 0004h
RXFCON1_RXF11EN_POSN                     equ 0003h
RXFCON1_RXF11EN_POSITION                 equ 0003h
RXFCON1_RXF11EN_SIZE                     equ 0001h
RXFCON1_RXF11EN_LENGTH                   equ 0001h
RXFCON1_RXF11EN_MASK                     equ 0008h
RXFCON1_RXF12EN_POSN                     equ 0004h
RXFCON1_RXF12EN_POSITION                 equ 0004h
RXFCON1_RXF12EN_SIZE                     equ 0001h
RXFCON1_RXF12EN_LENGTH                   equ 0001h
RXFCON1_RXF12EN_MASK                     equ 0010h
RXFCON1_RXF13EN_POSN                     equ 0005h
RXFCON1_RXF13EN_POSITION                 equ 0005h
RXFCON1_RXF13EN_SIZE                     equ 0001h
RXFCON1_RXF13EN_LENGTH                   equ 0001h
RXFCON1_RXF13EN_MASK                     equ 0020h
RXFCON1_RXF14EN_POSN                     equ 0006h
RXFCON1_RXF14EN_POSITION                 equ 0006h
RXFCON1_RXF14EN_SIZE                     equ 0001h
RXFCON1_RXF14EN_LENGTH                   equ 0001h
RXFCON1_RXF14EN_MASK                     equ 0040h
RXFCON1_RXF15EN_POSN                     equ 0007h
RXFCON1_RXF15EN_POSITION                 equ 0007h
RXFCON1_RXF15EN_SIZE                     equ 0001h
RXFCON1_RXF15EN_LENGTH                   equ 0001h
RXFCON1_RXF15EN_MASK                     equ 0080h

// Register: RXF6SIDH
#define RXF6SIDH RXF6SIDH
RXF6SIDH                                 equ 0E48h
// bitfield definitions
RXF6SIDH_SID_POSN                        equ 0000h
RXF6SIDH_SID_POSITION                    equ 0000h
RXF6SIDH_SID_SIZE                        equ 0008h
RXF6SIDH_SID_LENGTH                      equ 0008h
RXF6SIDH_SID_MASK                        equ 00FFh
RXF6SIDH_SID3_POSN                       equ 0000h
RXF6SIDH_SID3_POSITION                   equ 0000h
RXF6SIDH_SID3_SIZE                       equ 0001h
RXF6SIDH_SID3_LENGTH                     equ 0001h
RXF6SIDH_SID3_MASK                       equ 0001h
RXF6SIDH_SID4_POSN                       equ 0001h
RXF6SIDH_SID4_POSITION                   equ 0001h
RXF6SIDH_SID4_SIZE                       equ 0001h
RXF6SIDH_SID4_LENGTH                     equ 0001h
RXF6SIDH_SID4_MASK                       equ 0002h
RXF6SIDH_SID5_POSN                       equ 0002h
RXF6SIDH_SID5_POSITION                   equ 0002h
RXF6SIDH_SID5_SIZE                       equ 0001h
RXF6SIDH_SID5_LENGTH                     equ 0001h
RXF6SIDH_SID5_MASK                       equ 0004h
RXF6SIDH_SID6_POSN                       equ 0003h
RXF6SIDH_SID6_POSITION                   equ 0003h
RXF6SIDH_SID6_SIZE                       equ 0001h
RXF6SIDH_SID6_LENGTH                     equ 0001h
RXF6SIDH_SID6_MASK                       equ 0008h
RXF6SIDH_SID7_POSN                       equ 0004h
RXF6SIDH_SID7_POSITION                   equ 0004h
RXF6SIDH_SID7_SIZE                       equ 0001h
RXF6SIDH_SID7_LENGTH                     equ 0001h
RXF6SIDH_SID7_MASK                       equ 0010h
RXF6SIDH_SID8_POSN                       equ 0005h
RXF6SIDH_SID8_POSITION                   equ 0005h
RXF6SIDH_SID8_SIZE                       equ 0001h
RXF6SIDH_SID8_LENGTH                     equ 0001h
RXF6SIDH_SID8_MASK                       equ 0020h
RXF6SIDH_SID9_POSN                       equ 0006h
RXF6SIDH_SID9_POSITION                   equ 0006h
RXF6SIDH_SID9_SIZE                       equ 0001h
RXF6SIDH_SID9_LENGTH                     equ 0001h
RXF6SIDH_SID9_MASK                       equ 0040h
RXF6SIDH_SID10_POSN                      equ 0007h
RXF6SIDH_SID10_POSITION                  equ 0007h
RXF6SIDH_SID10_SIZE                      equ 0001h
RXF6SIDH_SID10_LENGTH                    equ 0001h
RXF6SIDH_SID10_MASK                      equ 0080h
RXF6SIDH_RXF6SID3_POSN                   equ 0000h
RXF6SIDH_RXF6SID3_POSITION               equ 0000h
RXF6SIDH_RXF6SID3_SIZE                   equ 0001h
RXF6SIDH_RXF6SID3_LENGTH                 equ 0001h
RXF6SIDH_RXF6SID3_MASK                   equ 0001h
RXF6SIDH_RXF6SID4_POSN                   equ 0001h
RXF6SIDH_RXF6SID4_POSITION               equ 0001h
RXF6SIDH_RXF6SID4_SIZE                   equ 0001h
RXF6SIDH_RXF6SID4_LENGTH                 equ 0001h
RXF6SIDH_RXF6SID4_MASK                   equ 0002h
RXF6SIDH_RXF6SID5_POSN                   equ 0002h
RXF6SIDH_RXF6SID5_POSITION               equ 0002h
RXF6SIDH_RXF6SID5_SIZE                   equ 0001h
RXF6SIDH_RXF6SID5_LENGTH                 equ 0001h
RXF6SIDH_RXF6SID5_MASK                   equ 0004h
RXF6SIDH_RXF6SID6_POSN                   equ 0003h
RXF6SIDH_RXF6SID6_POSITION               equ 0003h
RXF6SIDH_RXF6SID6_SIZE                   equ 0001h
RXF6SIDH_RXF6SID6_LENGTH                 equ 0001h
RXF6SIDH_RXF6SID6_MASK                   equ 0008h
RXF6SIDH_RXF6SID7_POSN                   equ 0004h
RXF6SIDH_RXF6SID7_POSITION               equ 0004h
RXF6SIDH_RXF6SID7_SIZE                   equ 0001h
RXF6SIDH_RXF6SID7_LENGTH                 equ 0001h
RXF6SIDH_RXF6SID7_MASK                   equ 0010h
RXF6SIDH_RXF6SID8_POSN                   equ 0005h
RXF6SIDH_RXF6SID8_POSITION               equ 0005h
RXF6SIDH_RXF6SID8_SIZE                   equ 0001h
RXF6SIDH_RXF6SID8_LENGTH                 equ 0001h
RXF6SIDH_RXF6SID8_MASK                   equ 0020h
RXF6SIDH_RXF6SID9_POSN                   equ 0006h
RXF6SIDH_RXF6SID9_POSITION               equ 0006h
RXF6SIDH_RXF6SID9_SIZE                   equ 0001h
RXF6SIDH_RXF6SID9_LENGTH                 equ 0001h
RXF6SIDH_RXF6SID9_MASK                   equ 0040h
RXF6SIDH_RXF6SID10_POSN                  equ 0007h
RXF6SIDH_RXF6SID10_POSITION              equ 0007h
RXF6SIDH_RXF6SID10_SIZE                  equ 0001h
RXF6SIDH_RXF6SID10_LENGTH                equ 0001h
RXF6SIDH_RXF6SID10_MASK                  equ 0080h

// Register: RXF6SIDL
#define RXF6SIDL RXF6SIDL
RXF6SIDL                                 equ 0E49h
// bitfield definitions
RXF6SIDL_EID_POSN                        equ 0000h
RXF6SIDL_EID_POSITION                    equ 0000h
RXF6SIDL_EID_SIZE                        equ 0002h
RXF6SIDL_EID_LENGTH                      equ 0002h
RXF6SIDL_EID_MASK                        equ 0003h
RXF6SIDL_EXIDEN_POSN                     equ 0003h
RXF6SIDL_EXIDEN_POSITION                 equ 0003h
RXF6SIDL_EXIDEN_SIZE                     equ 0001h
RXF6SIDL_EXIDEN_LENGTH                   equ 0001h
RXF6SIDL_EXIDEN_MASK                     equ 0008h
RXF6SIDL_SID_POSN                        equ 0005h
RXF6SIDL_SID_POSITION                    equ 0005h
RXF6SIDL_SID_SIZE                        equ 0003h
RXF6SIDL_SID_LENGTH                      equ 0003h
RXF6SIDL_SID_MASK                        equ 00E0h
RXF6SIDL_EID16_POSN                      equ 0000h
RXF6SIDL_EID16_POSITION                  equ 0000h
RXF6SIDL_EID16_SIZE                      equ 0001h
RXF6SIDL_EID16_LENGTH                    equ 0001h
RXF6SIDL_EID16_MASK                      equ 0001h
RXF6SIDL_EID17_POSN                      equ 0001h
RXF6SIDL_EID17_POSITION                  equ 0001h
RXF6SIDL_EID17_SIZE                      equ 0001h
RXF6SIDL_EID17_LENGTH                    equ 0001h
RXF6SIDL_EID17_MASK                      equ 0002h
RXF6SIDL_SID0_POSN                       equ 0005h
RXF6SIDL_SID0_POSITION                   equ 0005h
RXF6SIDL_SID0_SIZE                       equ 0001h
RXF6SIDL_SID0_LENGTH                     equ 0001h
RXF6SIDL_SID0_MASK                       equ 0020h
RXF6SIDL_SID1_POSN                       equ 0006h
RXF6SIDL_SID1_POSITION                   equ 0006h
RXF6SIDL_SID1_SIZE                       equ 0001h
RXF6SIDL_SID1_LENGTH                     equ 0001h
RXF6SIDL_SID1_MASK                       equ 0040h
RXF6SIDL_SID2_POSN                       equ 0007h
RXF6SIDL_SID2_POSITION                   equ 0007h
RXF6SIDL_SID2_SIZE                       equ 0001h
RXF6SIDL_SID2_LENGTH                     equ 0001h
RXF6SIDL_SID2_MASK                       equ 0080h
RXF6SIDL_RXF6EID16_POSN                  equ 0000h
RXF6SIDL_RXF6EID16_POSITION              equ 0000h
RXF6SIDL_RXF6EID16_SIZE                  equ 0001h
RXF6SIDL_RXF6EID16_LENGTH                equ 0001h
RXF6SIDL_RXF6EID16_MASK                  equ 0001h
RXF6SIDL_RXF6EID17_POSN                  equ 0001h
RXF6SIDL_RXF6EID17_POSITION              equ 0001h
RXF6SIDL_RXF6EID17_SIZE                  equ 0001h
RXF6SIDL_RXF6EID17_LENGTH                equ 0001h
RXF6SIDL_RXF6EID17_MASK                  equ 0002h
RXF6SIDL_RXF6EXIDEN_POSN                 equ 0003h
RXF6SIDL_RXF6EXIDEN_POSITION             equ 0003h
RXF6SIDL_RXF6EXIDEN_SIZE                 equ 0001h
RXF6SIDL_RXF6EXIDEN_LENGTH               equ 0001h
RXF6SIDL_RXF6EXIDEN_MASK                 equ 0008h
RXF6SIDL_RXF6SID0_POSN                   equ 0005h
RXF6SIDL_RXF6SID0_POSITION               equ 0005h
RXF6SIDL_RXF6SID0_SIZE                   equ 0001h
RXF6SIDL_RXF6SID0_LENGTH                 equ 0001h
RXF6SIDL_RXF6SID0_MASK                   equ 0020h
RXF6SIDL_RXF6SID1_POSN                   equ 0006h
RXF6SIDL_RXF6SID1_POSITION               equ 0006h
RXF6SIDL_RXF6SID1_SIZE                   equ 0001h
RXF6SIDL_RXF6SID1_LENGTH                 equ 0001h
RXF6SIDL_RXF6SID1_MASK                   equ 0040h
RXF6SIDL_RXF6SID2_POSN                   equ 0007h
RXF6SIDL_RXF6SID2_POSITION               equ 0007h
RXF6SIDL_RXF6SID2_SIZE                   equ 0001h
RXF6SIDL_RXF6SID2_LENGTH                 equ 0001h
RXF6SIDL_RXF6SID2_MASK                   equ 0080h

// Register: RXF6EIDH
#define RXF6EIDH RXF6EIDH
RXF6EIDH                                 equ 0E4Ah
// bitfield definitions
RXF6EIDH_EID_POSN                        equ 0000h
RXF6EIDH_EID_POSITION                    equ 0000h
RXF6EIDH_EID_SIZE                        equ 0008h
RXF6EIDH_EID_LENGTH                      equ 0008h
RXF6EIDH_EID_MASK                        equ 00FFh
RXF6EIDH_EID8_POSN                       equ 0000h
RXF6EIDH_EID8_POSITION                   equ 0000h
RXF6EIDH_EID8_SIZE                       equ 0001h
RXF6EIDH_EID8_LENGTH                     equ 0001h
RXF6EIDH_EID8_MASK                       equ 0001h
RXF6EIDH_EID9_POSN                       equ 0001h
RXF6EIDH_EID9_POSITION                   equ 0001h
RXF6EIDH_EID9_SIZE                       equ 0001h
RXF6EIDH_EID9_LENGTH                     equ 0001h
RXF6EIDH_EID9_MASK                       equ 0002h
RXF6EIDH_EID10_POSN                      equ 0002h
RXF6EIDH_EID10_POSITION                  equ 0002h
RXF6EIDH_EID10_SIZE                      equ 0001h
RXF6EIDH_EID10_LENGTH                    equ 0001h
RXF6EIDH_EID10_MASK                      equ 0004h
RXF6EIDH_EID11_POSN                      equ 0003h
RXF6EIDH_EID11_POSITION                  equ 0003h
RXF6EIDH_EID11_SIZE                      equ 0001h
RXF6EIDH_EID11_LENGTH                    equ 0001h
RXF6EIDH_EID11_MASK                      equ 0008h
RXF6EIDH_EID12_POSN                      equ 0004h
RXF6EIDH_EID12_POSITION                  equ 0004h
RXF6EIDH_EID12_SIZE                      equ 0001h
RXF6EIDH_EID12_LENGTH                    equ 0001h
RXF6EIDH_EID12_MASK                      equ 0010h
RXF6EIDH_EID13_POSN                      equ 0005h
RXF6EIDH_EID13_POSITION                  equ 0005h
RXF6EIDH_EID13_SIZE                      equ 0001h
RXF6EIDH_EID13_LENGTH                    equ 0001h
RXF6EIDH_EID13_MASK                      equ 0020h
RXF6EIDH_EID14_POSN                      equ 0006h
RXF6EIDH_EID14_POSITION                  equ 0006h
RXF6EIDH_EID14_SIZE                      equ 0001h
RXF6EIDH_EID14_LENGTH                    equ 0001h
RXF6EIDH_EID14_MASK                      equ 0040h
RXF6EIDH_EID15_POSN                      equ 0007h
RXF6EIDH_EID15_POSITION                  equ 0007h
RXF6EIDH_EID15_SIZE                      equ 0001h
RXF6EIDH_EID15_LENGTH                    equ 0001h
RXF6EIDH_EID15_MASK                      equ 0080h
RXF6EIDH_RXF6EID8_POSN                   equ 0000h
RXF6EIDH_RXF6EID8_POSITION               equ 0000h
RXF6EIDH_RXF6EID8_SIZE                   equ 0001h
RXF6EIDH_RXF6EID8_LENGTH                 equ 0001h
RXF6EIDH_RXF6EID8_MASK                   equ 0001h
RXF6EIDH_RXF6EID9_POSN                   equ 0001h
RXF6EIDH_RXF6EID9_POSITION               equ 0001h
RXF6EIDH_RXF6EID9_SIZE                   equ 0001h
RXF6EIDH_RXF6EID9_LENGTH                 equ 0001h
RXF6EIDH_RXF6EID9_MASK                   equ 0002h
RXF6EIDH_RXF6EID10_POSN                  equ 0002h
RXF6EIDH_RXF6EID10_POSITION              equ 0002h
RXF6EIDH_RXF6EID10_SIZE                  equ 0001h
RXF6EIDH_RXF6EID10_LENGTH                equ 0001h
RXF6EIDH_RXF6EID10_MASK                  equ 0004h
RXF6EIDH_RXF6EID11_POSN                  equ 0003h
RXF6EIDH_RXF6EID11_POSITION              equ 0003h
RXF6EIDH_RXF6EID11_SIZE                  equ 0001h
RXF6EIDH_RXF6EID11_LENGTH                equ 0001h
RXF6EIDH_RXF6EID11_MASK                  equ 0008h
RXF6EIDH_RXF6EID12_POSN                  equ 0004h
RXF6EIDH_RXF6EID12_POSITION              equ 0004h
RXF6EIDH_RXF6EID12_SIZE                  equ 0001h
RXF6EIDH_RXF6EID12_LENGTH                equ 0001h
RXF6EIDH_RXF6EID12_MASK                  equ 0010h
RXF6EIDH_RXF6EID13_POSN                  equ 0005h
RXF6EIDH_RXF6EID13_POSITION              equ 0005h
RXF6EIDH_RXF6EID13_SIZE                  equ 0001h
RXF6EIDH_RXF6EID13_LENGTH                equ 0001h
RXF6EIDH_RXF6EID13_MASK                  equ 0020h
RXF6EIDH_RXF6EID14_POSN                  equ 0006h
RXF6EIDH_RXF6EID14_POSITION              equ 0006h
RXF6EIDH_RXF6EID14_SIZE                  equ 0001h
RXF6EIDH_RXF6EID14_LENGTH                equ 0001h
RXF6EIDH_RXF6EID14_MASK                  equ 0040h
RXF6EIDH_RXF6EID15_POSN                  equ 0007h
RXF6EIDH_RXF6EID15_POSITION              equ 0007h
RXF6EIDH_RXF6EID15_SIZE                  equ 0001h
RXF6EIDH_RXF6EID15_LENGTH                equ 0001h
RXF6EIDH_RXF6EID15_MASK                  equ 0080h

// Register: RXF6EIDL
#define RXF6EIDL RXF6EIDL
RXF6EIDL                                 equ 0E4Bh
// bitfield definitions
RXF6EIDL_EID_POSN                        equ 0000h
RXF6EIDL_EID_POSITION                    equ 0000h
RXF6EIDL_EID_SIZE                        equ 0008h
RXF6EIDL_EID_LENGTH                      equ 0008h
RXF6EIDL_EID_MASK                        equ 00FFh
RXF6EIDL_EID0_POSN                       equ 0000h
RXF6EIDL_EID0_POSITION                   equ 0000h
RXF6EIDL_EID0_SIZE                       equ 0001h
RXF6EIDL_EID0_LENGTH                     equ 0001h
RXF6EIDL_EID0_MASK                       equ 0001h
RXF6EIDL_EID1_POSN                       equ 0001h
RXF6EIDL_EID1_POSITION                   equ 0001h
RXF6EIDL_EID1_SIZE                       equ 0001h
RXF6EIDL_EID1_LENGTH                     equ 0001h
RXF6EIDL_EID1_MASK                       equ 0002h
RXF6EIDL_EID2_POSN                       equ 0002h
RXF6EIDL_EID2_POSITION                   equ 0002h
RXF6EIDL_EID2_SIZE                       equ 0001h
RXF6EIDL_EID2_LENGTH                     equ 0001h
RXF6EIDL_EID2_MASK                       equ 0004h
RXF6EIDL_EID3_POSN                       equ 0003h
RXF6EIDL_EID3_POSITION                   equ 0003h
RXF6EIDL_EID3_SIZE                       equ 0001h
RXF6EIDL_EID3_LENGTH                     equ 0001h
RXF6EIDL_EID3_MASK                       equ 0008h
RXF6EIDL_EID4_POSN                       equ 0004h
RXF6EIDL_EID4_POSITION                   equ 0004h
RXF6EIDL_EID4_SIZE                       equ 0001h
RXF6EIDL_EID4_LENGTH                     equ 0001h
RXF6EIDL_EID4_MASK                       equ 0010h
RXF6EIDL_EID5_POSN                       equ 0005h
RXF6EIDL_EID5_POSITION                   equ 0005h
RXF6EIDL_EID5_SIZE                       equ 0001h
RXF6EIDL_EID5_LENGTH                     equ 0001h
RXF6EIDL_EID5_MASK                       equ 0020h
RXF6EIDL_EID6_POSN                       equ 0006h
RXF6EIDL_EID6_POSITION                   equ 0006h
RXF6EIDL_EID6_SIZE                       equ 0001h
RXF6EIDL_EID6_LENGTH                     equ 0001h
RXF6EIDL_EID6_MASK                       equ 0040h
RXF6EIDL_EID7_POSN                       equ 0007h
RXF6EIDL_EID7_POSITION                   equ 0007h
RXF6EIDL_EID7_SIZE                       equ 0001h
RXF6EIDL_EID7_LENGTH                     equ 0001h
RXF6EIDL_EID7_MASK                       equ 0080h
RXF6EIDL_RXF6EID0_POSN                   equ 0000h
RXF6EIDL_RXF6EID0_POSITION               equ 0000h
RXF6EIDL_RXF6EID0_SIZE                   equ 0001h
RXF6EIDL_RXF6EID0_LENGTH                 equ 0001h
RXF6EIDL_RXF6EID0_MASK                   equ 0001h
RXF6EIDL_RXF6EID1_POSN                   equ 0001h
RXF6EIDL_RXF6EID1_POSITION               equ 0001h
RXF6EIDL_RXF6EID1_SIZE                   equ 0001h
RXF6EIDL_RXF6EID1_LENGTH                 equ 0001h
RXF6EIDL_RXF6EID1_MASK                   equ 0002h
RXF6EIDL_RXF6EID2_POSN                   equ 0002h
RXF6EIDL_RXF6EID2_POSITION               equ 0002h
RXF6EIDL_RXF6EID2_SIZE                   equ 0001h
RXF6EIDL_RXF6EID2_LENGTH                 equ 0001h
RXF6EIDL_RXF6EID2_MASK                   equ 0004h
RXF6EIDL_RXF6EID3_POSN                   equ 0003h
RXF6EIDL_RXF6EID3_POSITION               equ 0003h
RXF6EIDL_RXF6EID3_SIZE                   equ 0001h
RXF6EIDL_RXF6EID3_LENGTH                 equ 0001h
RXF6EIDL_RXF6EID3_MASK                   equ 0008h
RXF6EIDL_RXF6EID4_POSN                   equ 0004h
RXF6EIDL_RXF6EID4_POSITION               equ 0004h
RXF6EIDL_RXF6EID4_SIZE                   equ 0001h
RXF6EIDL_RXF6EID4_LENGTH                 equ 0001h
RXF6EIDL_RXF6EID4_MASK                   equ 0010h
RXF6EIDL_RXF6EID5_POSN                   equ 0005h
RXF6EIDL_RXF6EID5_POSITION               equ 0005h
RXF6EIDL_RXF6EID5_SIZE                   equ 0001h
RXF6EIDL_RXF6EID5_LENGTH                 equ 0001h
RXF6EIDL_RXF6EID5_MASK                   equ 0020h
RXF6EIDL_RXF6EID6_POSN                   equ 0006h
RXF6EIDL_RXF6EID6_POSITION               equ 0006h
RXF6EIDL_RXF6EID6_SIZE                   equ 0001h
RXF6EIDL_RXF6EID6_LENGTH                 equ 0001h
RXF6EIDL_RXF6EID6_MASK                   equ 0040h
RXF6EIDL_RXF6EID7_POSN                   equ 0007h
RXF6EIDL_RXF6EID7_POSITION               equ 0007h
RXF6EIDL_RXF6EID7_SIZE                   equ 0001h
RXF6EIDL_RXF6EID7_LENGTH                 equ 0001h
RXF6EIDL_RXF6EID7_MASK                   equ 0080h

