GopalSaraf/Practicals/PSDL/include/proc/pic18f45k80.inc
// Register: RXFBCON1
#define RXFBCON1 RXFBCON1
RXFBCON1                                 equ 0E72h
// bitfield definitions
RXFBCON1_F2BP_POSN                       equ 0000h
RXFBCON1_F2BP_POSITION                   equ 0000h
RXFBCON1_F2BP_SIZE                       equ 0004h
RXFBCON1_F2BP_LENGTH                     equ 0004h
RXFBCON1_F2BP_MASK                       equ 000Fh
RXFBCON1_F3BP_POSN                       equ 0004h
RXFBCON1_F3BP_POSITION                   equ 0004h
RXFBCON1_F3BP_SIZE                       equ 0004h
RXFBCON1_F3BP_LENGTH                     equ 0004h
RXFBCON1_F3BP_MASK                       equ 00F0h
RXFBCON1_F2BP_0_POSN                     equ 0000h
RXFBCON1_F2BP_0_POSITION                 equ 0000h
RXFBCON1_F2BP_0_SIZE                     equ 0001h
RXFBCON1_F2BP_0_LENGTH                   equ 0001h
RXFBCON1_F2BP_0_MASK                     equ 0001h
RXFBCON1_F2BP_1_POSN                     equ 0001h
RXFBCON1_F2BP_1_POSITION                 equ 0001h
RXFBCON1_F2BP_1_SIZE                     equ 0001h
RXFBCON1_F2BP_1_LENGTH                   equ 0001h
RXFBCON1_F2BP_1_MASK                     equ 0002h
RXFBCON1_F2BP_2_POSN                     equ 0002h
RXFBCON1_F2BP_2_POSITION                 equ 0002h
RXFBCON1_F2BP_2_SIZE                     equ 0001h
RXFBCON1_F2BP_2_LENGTH                   equ 0001h
RXFBCON1_F2BP_2_MASK                     equ 0004h
RXFBCON1_F2BP_3_POSN                     equ 0003h
RXFBCON1_F2BP_3_POSITION                 equ 0003h
RXFBCON1_F2BP_3_SIZE                     equ 0001h
RXFBCON1_F2BP_3_LENGTH                   equ 0001h
RXFBCON1_F2BP_3_MASK                     equ 0008h
RXFBCON1_F3BP_0_POSN                     equ 0004h
RXFBCON1_F3BP_0_POSITION                 equ 0004h
RXFBCON1_F3BP_0_SIZE                     equ 0001h
RXFBCON1_F3BP_0_LENGTH                   equ 0001h
RXFBCON1_F3BP_0_MASK                     equ 0010h
RXFBCON1_F3BP_1_POSN                     equ 0005h
RXFBCON1_F3BP_1_POSITION                 equ 0005h
RXFBCON1_F3BP_1_SIZE                     equ 0001h
RXFBCON1_F3BP_1_LENGTH                   equ 0001h
RXFBCON1_F3BP_1_MASK                     equ 0020h
RXFBCON1_F3BP_2_POSN                     equ 0006h
RXFBCON1_F3BP_2_POSITION                 equ 0006h
RXFBCON1_F3BP_2_SIZE                     equ 0001h
RXFBCON1_F3BP_2_LENGTH                   equ 0001h
RXFBCON1_F3BP_2_MASK                     equ 0040h
RXFBCON1_F3BP_3_POSN                     equ 0007h
RXFBCON1_F3BP_3_POSITION                 equ 0007h
RXFBCON1_F3BP_3_SIZE                     equ 0001h
RXFBCON1_F3BP_3_LENGTH                   equ 0001h
RXFBCON1_F3BP_3_MASK                     equ 0080h
RXFBCON1_F2BP_01_POSN                    equ 0000h
RXFBCON1_F2BP_01_POSITION                equ 0000h
RXFBCON1_F2BP_01_SIZE                    equ 0001h
RXFBCON1_F2BP_01_LENGTH                  equ 0001h
RXFBCON1_F2BP_01_MASK                    equ 0001h

// Register: RXFBCON2
#define RXFBCON2 RXFBCON2
RXFBCON2                                 equ 0E73h
// bitfield definitions
RXFBCON2_F4BP_POSN                       equ 0000h
RXFBCON2_F4BP_POSITION                   equ 0000h
RXFBCON2_F4BP_SIZE                       equ 0004h
RXFBCON2_F4BP_LENGTH                     equ 0004h
RXFBCON2_F4BP_MASK                       equ 000Fh
RXFBCON2_F5BP_POSN                       equ 0004h
RXFBCON2_F5BP_POSITION                   equ 0004h
RXFBCON2_F5BP_SIZE                       equ 0004h
RXFBCON2_F5BP_LENGTH                     equ 0004h
RXFBCON2_F5BP_MASK                       equ 00F0h
RXFBCON2_F4BP_0_POSN                     equ 0000h
RXFBCON2_F4BP_0_POSITION                 equ 0000h
RXFBCON2_F4BP_0_SIZE                     equ 0001h
RXFBCON2_F4BP_0_LENGTH                   equ 0001h
RXFBCON2_F4BP_0_MASK                     equ 0001h
RXFBCON2_F4BP_1_POSN                     equ 0001h
RXFBCON2_F4BP_1_POSITION                 equ 0001h
RXFBCON2_F4BP_1_SIZE                     equ 0001h
RXFBCON2_F4BP_1_LENGTH                   equ 0001h
RXFBCON2_F4BP_1_MASK                     equ 0002h
RXFBCON2_F4BP_2_POSN                     equ 0002h
RXFBCON2_F4BP_2_POSITION                 equ 0002h
RXFBCON2_F4BP_2_SIZE                     equ 0001h
RXFBCON2_F4BP_2_LENGTH                   equ 0001h
RXFBCON2_F4BP_2_MASK                     equ 0004h
RXFBCON2_F4BP_3_POSN                     equ 0003h
RXFBCON2_F4BP_3_POSITION                 equ 0003h
RXFBCON2_F4BP_3_SIZE                     equ 0001h
RXFBCON2_F4BP_3_LENGTH                   equ 0001h
RXFBCON2_F4BP_3_MASK                     equ 0008h
RXFBCON2_F5BP_0_POSN                     equ 0004h
RXFBCON2_F5BP_0_POSITION                 equ 0004h
RXFBCON2_F5BP_0_SIZE                     equ 0001h
RXFBCON2_F5BP_0_LENGTH                   equ 0001h
RXFBCON2_F5BP_0_MASK                     equ 0010h
RXFBCON2_F5BP_1_POSN                     equ 0005h
RXFBCON2_F5BP_1_POSITION                 equ 0005h
RXFBCON2_F5BP_1_SIZE                     equ 0001h
RXFBCON2_F5BP_1_LENGTH                   equ 0001h
RXFBCON2_F5BP_1_MASK                     equ 0020h
RXFBCON2_F5BP_2_POSN                     equ 0006h
RXFBCON2_F5BP_2_POSITION                 equ 0006h
RXFBCON2_F5BP_2_SIZE                     equ 0001h
RXFBCON2_F5BP_2_LENGTH                   equ 0001h
RXFBCON2_F5BP_2_MASK                     equ 0040h
RXFBCON2_F5BP_3_POSN                     equ 0007h
RXFBCON2_F5BP_3_POSITION                 equ 0007h
RXFBCON2_F5BP_3_SIZE                     equ 0001h
RXFBCON2_F5BP_3_LENGTH                   equ 0001h
RXFBCON2_F5BP_3_MASK                     equ 0080h
RXFBCON2_F4BP_01_POSN                    equ 0000h
RXFBCON2_F4BP_01_POSITION                equ 0000h
RXFBCON2_F4BP_01_SIZE                    equ 0001h
RXFBCON2_F4BP_01_LENGTH                  equ 0001h
RXFBCON2_F4BP_01_MASK                    equ 0001h

// Register: RXFBCON3
#define RXFBCON3 RXFBCON3
RXFBCON3                                 equ 0E74h
// bitfield definitions
RXFBCON3_F6BP_POSN                       equ 0000h
RXFBCON3_F6BP_POSITION                   equ 0000h
RXFBCON3_F6BP_SIZE                       equ 0004h
RXFBCON3_F6BP_LENGTH                     equ 0004h
RXFBCON3_F6BP_MASK                       equ 000Fh
RXFBCON3_F7BP_POSN                       equ 0004h
RXFBCON3_F7BP_POSITION                   equ 0004h
RXFBCON3_F7BP_SIZE                       equ 0004h
RXFBCON3_F7BP_LENGTH                     equ 0004h
RXFBCON3_F7BP_MASK                       equ 00F0h
RXFBCON3_F6BP_0_POSN                     equ 0000h
RXFBCON3_F6BP_0_POSITION                 equ 0000h
RXFBCON3_F6BP_0_SIZE                     equ 0001h
RXFBCON3_F6BP_0_LENGTH                   equ 0001h
RXFBCON3_F6BP_0_MASK                     equ 0001h
RXFBCON3_F6BP_1_POSN                     equ 0001h
RXFBCON3_F6BP_1_POSITION                 equ 0001h
RXFBCON3_F6BP_1_SIZE                     equ 0001h
RXFBCON3_F6BP_1_LENGTH                   equ 0001h
RXFBCON3_F6BP_1_MASK                     equ 0002h
RXFBCON3_F6BP_2_POSN                     equ 0002h
RXFBCON3_F6BP_2_POSITION                 equ 0002h
RXFBCON3_F6BP_2_SIZE                     equ 0001h
RXFBCON3_F6BP_2_LENGTH                   equ 0001h
RXFBCON3_F6BP_2_MASK                     equ 0004h
RXFBCON3_F6BP_3_POSN                     equ 0003h
RXFBCON3_F6BP_3_POSITION                 equ 0003h
RXFBCON3_F6BP_3_SIZE                     equ 0001h
RXFBCON3_F6BP_3_LENGTH                   equ 0001h
RXFBCON3_F6BP_3_MASK                     equ 0008h
RXFBCON3_F7BP_0_POSN                     equ 0004h
RXFBCON3_F7BP_0_POSITION                 equ 0004h
RXFBCON3_F7BP_0_SIZE                     equ 0001h
RXFBCON3_F7BP_0_LENGTH                   equ 0001h
RXFBCON3_F7BP_0_MASK                     equ 0010h
RXFBCON3_F7BP_1_POSN                     equ 0005h
RXFBCON3_F7BP_1_POSITION                 equ 0005h
RXFBCON3_F7BP_1_SIZE                     equ 0001h
RXFBCON3_F7BP_1_LENGTH                   equ 0001h
RXFBCON3_F7BP_1_MASK                     equ 0020h
RXFBCON3_F7BP_2_POSN                     equ 0006h
RXFBCON3_F7BP_2_POSITION                 equ 0006h
RXFBCON3_F7BP_2_SIZE                     equ 0001h
RXFBCON3_F7BP_2_LENGTH                   equ 0001h
RXFBCON3_F7BP_2_MASK                     equ 0040h
RXFBCON3_F7BP_3_POSN                     equ 0007h
RXFBCON3_F7BP_3_POSITION                 equ 0007h
RXFBCON3_F7BP_3_SIZE                     equ 0001h
RXFBCON3_F7BP_3_LENGTH                   equ 0001h
RXFBCON3_F7BP_3_MASK                     equ 0080h
RXFBCON3_F6BP_01_POSN                    equ 0000h
RXFBCON3_F6BP_01_POSITION                equ 0000h
RXFBCON3_F6BP_01_SIZE                    equ 0001h
RXFBCON3_F6BP_01_LENGTH                  equ 0001h
RXFBCON3_F6BP_01_MASK                    equ 0001h

// Register: RXFBCON4
#define RXFBCON4 RXFBCON4
RXFBCON4                                 equ 0E75h
// bitfield definitions
RXFBCON4_F8BP_POSN                       equ 0000h
RXFBCON4_F8BP_POSITION                   equ 0000h
RXFBCON4_F8BP_SIZE                       equ 0004h
RXFBCON4_F8BP_LENGTH                     equ 0004h
RXFBCON4_F8BP_MASK                       equ 000Fh
RXFBCON4_F9BP_POSN                       equ 0004h
RXFBCON4_F9BP_POSITION                   equ 0004h
RXFBCON4_F9BP_SIZE                       equ 0004h
RXFBCON4_F9BP_LENGTH                     equ 0004h
RXFBCON4_F9BP_MASK                       equ 00F0h
RXFBCON4_F8BP_0_POSN                     equ 0000h
RXFBCON4_F8BP_0_POSITION                 equ 0000h
RXFBCON4_F8BP_0_SIZE                     equ 0001h
RXFBCON4_F8BP_0_LENGTH                   equ 0001h
RXFBCON4_F8BP_0_MASK                     equ 0001h
RXFBCON4_F8BP_1_POSN                     equ 0001h
RXFBCON4_F8BP_1_POSITION                 equ 0001h
RXFBCON4_F8BP_1_SIZE                     equ 0001h
RXFBCON4_F8BP_1_LENGTH                   equ 0001h
RXFBCON4_F8BP_1_MASK                     equ 0002h
RXFBCON4_F8BP_2_POSN                     equ 0002h
RXFBCON4_F8BP_2_POSITION                 equ 0002h
RXFBCON4_F8BP_2_SIZE                     equ 0001h
RXFBCON4_F8BP_2_LENGTH                   equ 0001h
RXFBCON4_F8BP_2_MASK                     equ 0004h
RXFBCON4_F8BP_3_POSN                     equ 0003h
RXFBCON4_F8BP_3_POSITION                 equ 0003h
RXFBCON4_F8BP_3_SIZE                     equ 0001h
RXFBCON4_F8BP_3_LENGTH                   equ 0001h
RXFBCON4_F8BP_3_MASK                     equ 0008h
RXFBCON4_F9BP_0_POSN                     equ 0004h
RXFBCON4_F9BP_0_POSITION                 equ 0004h
RXFBCON4_F9BP_0_SIZE                     equ 0001h
RXFBCON4_F9BP_0_LENGTH                   equ 0001h
RXFBCON4_F9BP_0_MASK                     equ 0010h
RXFBCON4_F9BP_1_POSN                     equ 0005h
RXFBCON4_F9BP_1_POSITION                 equ 0005h
RXFBCON4_F9BP_1_SIZE                     equ 0001h
RXFBCON4_F9BP_1_LENGTH                   equ 0001h
RXFBCON4_F9BP_1_MASK                     equ 0020h
RXFBCON4_F9BP_2_POSN                     equ 0006h
RXFBCON4_F9BP_2_POSITION                 equ 0006h
RXFBCON4_F9BP_2_SIZE                     equ 0001h
RXFBCON4_F9BP_2_LENGTH                   equ 0001h
RXFBCON4_F9BP_2_MASK                     equ 0040h
RXFBCON4_F9BP_3_POSN                     equ 0007h
RXFBCON4_F9BP_3_POSITION                 equ 0007h
RXFBCON4_F9BP_3_SIZE                     equ 0001h
RXFBCON4_F9BP_3_LENGTH                   equ 0001h
RXFBCON4_F9BP_3_MASK                     equ 0080h
RXFBCON4_F8BP_01_POSN                    equ 0000h
RXFBCON4_F8BP_01_POSITION                equ 0000h
RXFBCON4_F8BP_01_SIZE                    equ 0001h
RXFBCON4_F8BP_01_LENGTH                  equ 0001h
RXFBCON4_F8BP_01_MASK                    equ 0001h

// Register: RXFBCON5
#define RXFBCON5 RXFBCON5
RXFBCON5                                 equ 0E76h
// bitfield definitions
RXFBCON5_F10BP_POSN                      equ 0000h
RXFBCON5_F10BP_POSITION                  equ 0000h
RXFBCON5_F10BP_SIZE                      equ 0004h
RXFBCON5_F10BP_LENGTH                    equ 0004h
RXFBCON5_F10BP_MASK                      equ 000Fh
RXFBCON5_F11BP_POSN                      equ 0004h
RXFBCON5_F11BP_POSITION                  equ 0004h
RXFBCON5_F11BP_SIZE                      equ 0004h
RXFBCON5_F11BP_LENGTH                    equ 0004h
RXFBCON5_F11BP_MASK                      equ 00F0h
RXFBCON5_F10BP_0_POSN                    equ 0000h
RXFBCON5_F10BP_0_POSITION                equ 0000h
RXFBCON5_F10BP_0_SIZE                    equ 0001h
RXFBCON5_F10BP_0_LENGTH                  equ 0001h
RXFBCON5_F10BP_0_MASK                    equ 0001h
RXFBCON5_F10BP_1_POSN                    equ 0001h
RXFBCON5_F10BP_1_POSITION                equ 0001h
RXFBCON5_F10BP_1_SIZE                    equ 0001h
RXFBCON5_F10BP_1_LENGTH                  equ 0001h
RXFBCON5_F10BP_1_MASK                    equ 0002h
RXFBCON5_F10BP_2_POSN                    equ 0002h
RXFBCON5_F10BP_2_POSITION                equ 0002h
RXFBCON5_F10BP_2_SIZE                    equ 0001h
RXFBCON5_F10BP_2_LENGTH                  equ 0001h
RXFBCON5_F10BP_2_MASK                    equ 0004h
RXFBCON5_F10BP_3_POSN                    equ 0003h
RXFBCON5_F10BP_3_POSITION                equ 0003h
RXFBCON5_F10BP_3_SIZE                    equ 0001h
RXFBCON5_F10BP_3_LENGTH                  equ 0001h
RXFBCON5_F10BP_3_MASK                    equ 0008h
RXFBCON5_F11BP_0_POSN                    equ 0004h
RXFBCON5_F11BP_0_POSITION                equ 0004h
RXFBCON5_F11BP_0_SIZE                    equ 0001h
RXFBCON5_F11BP_0_LENGTH                  equ 0001h
RXFBCON5_F11BP_0_MASK                    equ 0010h
RXFBCON5_F11BP_1_POSN                    equ 0005h
RXFBCON5_F11BP_1_POSITION                equ 0005h
RXFBCON5_F11BP_1_SIZE                    equ 0001h
RXFBCON5_F11BP_1_LENGTH                  equ 0001h
RXFBCON5_F11BP_1_MASK                    equ 0020h
RXFBCON5_F11BP_2_POSN                    equ 0006h
RXFBCON5_F11BP_2_POSITION                equ 0006h
RXFBCON5_F11BP_2_SIZE                    equ 0001h
RXFBCON5_F11BP_2_LENGTH                  equ 0001h
RXFBCON5_F11BP_2_MASK                    equ 0040h
RXFBCON5_F11BP_3_POSN                    equ 0007h
RXFBCON5_F11BP_3_POSITION                equ 0007h
RXFBCON5_F11BP_3_SIZE                    equ 0001h
RXFBCON5_F11BP_3_LENGTH                  equ 0001h
RXFBCON5_F11BP_3_MASK                    equ 0080h
RXFBCON5_F10BP_01_POSN                   equ 0000h
RXFBCON5_F10BP_01_POSITION               equ 0000h
RXFBCON5_F10BP_01_SIZE                   equ 0001h
RXFBCON5_F10BP_01_LENGTH                 equ 0001h
RXFBCON5_F10BP_01_MASK                   equ 0001h

// Register: RXFBCON6
#define RXFBCON6 RXFBCON6
RXFBCON6                                 equ 0E77h
// bitfield definitions
RXFBCON6_F12BP_POSN                      equ 0000h
RXFBCON6_F12BP_POSITION                  equ 0000h
RXFBCON6_F12BP_SIZE                      equ 0004h
RXFBCON6_F12BP_LENGTH                    equ 0004h
RXFBCON6_F12BP_MASK                      equ 000Fh
RXFBCON6_F13BP_POSN                      equ 0004h
RXFBCON6_F13BP_POSITION                  equ 0004h
RXFBCON6_F13BP_SIZE                      equ 0004h
RXFBCON6_F13BP_LENGTH                    equ 0004h
RXFBCON6_F13BP_MASK                      equ 00F0h
RXFBCON6_F12BP_0_POSN                    equ 0000h
RXFBCON6_F12BP_0_POSITION                equ 0000h
RXFBCON6_F12BP_0_SIZE                    equ 0001h
RXFBCON6_F12BP_0_LENGTH                  equ 0001h
RXFBCON6_F12BP_0_MASK                    equ 0001h
RXFBCON6_F12BP_1_POSN                    equ 0001h
RXFBCON6_F12BP_1_POSITION                equ 0001h
RXFBCON6_F12BP_1_SIZE                    equ 0001h
RXFBCON6_F12BP_1_LENGTH                  equ 0001h
RXFBCON6_F12BP_1_MASK                    equ 0002h
RXFBCON6_F12BP_2_POSN                    equ 0002h
RXFBCON6_F12BP_2_POSITION                equ 0002h
RXFBCON6_F12BP_2_SIZE                    equ 0001h
RXFBCON6_F12BP_2_LENGTH                  equ 0001h
RXFBCON6_F12BP_2_MASK                    equ 0004h
RXFBCON6_F12BP_3_POSN                    equ 0003h
RXFBCON6_F12BP_3_POSITION                equ 0003h
RXFBCON6_F12BP_3_SIZE                    equ 0001h
RXFBCON6_F12BP_3_LENGTH                  equ 0001h
RXFBCON6_F12BP_3_MASK                    equ 0008h
RXFBCON6_F13BP_0_POSN                    equ 0004h
RXFBCON6_F13BP_0_POSITION                equ 0004h
RXFBCON6_F13BP_0_SIZE                    equ 0001h
RXFBCON6_F13BP_0_LENGTH                  equ 0001h
RXFBCON6_F13BP_0_MASK                    equ 0010h
RXFBCON6_F13BP_1_POSN                    equ 0005h
RXFBCON6_F13BP_1_POSITION                equ 0005h
RXFBCON6_F13BP_1_SIZE                    equ 0001h
RXFBCON6_F13BP_1_LENGTH                  equ 0001h
RXFBCON6_F13BP_1_MASK                    equ 0020h
RXFBCON6_F13BP_2_POSN                    equ 0006h
RXFBCON6_F13BP_2_POSITION                equ 0006h
RXFBCON6_F13BP_2_SIZE                    equ 0001h
RXFBCON6_F13BP_2_LENGTH                  equ 0001h
RXFBCON6_F13BP_2_MASK                    equ 0040h
RXFBCON6_F13BP_3_POSN                    equ 0007h
RXFBCON6_F13BP_3_POSITION                equ 0007h
RXFBCON6_F13BP_3_SIZE                    equ 0001h
RXFBCON6_F13BP_3_LENGTH                  equ 0001h
RXFBCON6_F13BP_3_MASK                    equ 0080h
RXFBCON6_F12BP_01_POSN                   equ 0000h
RXFBCON6_F12BP_01_POSITION               equ 0000h
RXFBCON6_F12BP_01_SIZE                   equ 0001h
RXFBCON6_F12BP_01_LENGTH                 equ 0001h
RXFBCON6_F12BP_01_MASK                   equ 0001h

// Register: RXFBCON7
#define RXFBCON7 RXFBCON7
RXFBCON7                                 equ 0E78h
// bitfield definitions
RXFBCON7_F14BP_POSN                      equ 0000h
RXFBCON7_F14BP_POSITION                  equ 0000h
RXFBCON7_F14BP_SIZE                      equ 0004h
RXFBCON7_F14BP_LENGTH                    equ 0004h
RXFBCON7_F14BP_MASK                      equ 000Fh
RXFBCON7_F15BP_POSN                      equ 0004h
RXFBCON7_F15BP_POSITION                  equ 0004h
RXFBCON7_F15BP_SIZE                      equ 0004h
RXFBCON7_F15BP_LENGTH                    equ 0004h
RXFBCON7_F15BP_MASK                      equ 00F0h
RXFBCON7_F14BP_0_POSN                    equ 0000h
RXFBCON7_F14BP_0_POSITION                equ 0000h
RXFBCON7_F14BP_0_SIZE                    equ 0001h
RXFBCON7_F14BP_0_LENGTH                  equ 0001h
RXFBCON7_F14BP_0_MASK                    equ 0001h
RXFBCON7_F14BP_1_POSN                    equ 0001h
RXFBCON7_F14BP_1_POSITION                equ 0001h
RXFBCON7_F14BP_1_SIZE                    equ 0001h
RXFBCON7_F14BP_1_LENGTH                  equ 0001h
RXFBCON7_F14BP_1_MASK                    equ 0002h
RXFBCON7_F14BP_2_POSN                    equ 0002h
RXFBCON7_F14BP_2_POSITION                equ 0002h
RXFBCON7_F14BP_2_SIZE                    equ 0001h
RXFBCON7_F14BP_2_LENGTH                  equ 0001h
RXFBCON7_F14BP_2_MASK                    equ 0004h
RXFBCON7_F14BP_3_POSN                    equ 0003h
RXFBCON7_F14BP_3_POSITION                equ 0003h
RXFBCON7_F14BP_3_SIZE                    equ 0001h
RXFBCON7_F14BP_3_LENGTH                  equ 0001h
RXFBCON7_F14BP_3_MASK                    equ 0008h
RXFBCON7_F15BP_0_POSN                    equ 0004h
RXFBCON7_F15BP_0_POSITION                equ 0004h
RXFBCON7_F15BP_0_SIZE                    equ 0001h
RXFBCON7_F15BP_0_LENGTH                  equ 0001h
RXFBCON7_F15BP_0_MASK                    equ 0010h
RXFBCON7_F15BP_1_POSN                    equ 0005h
RXFBCON7_F15BP_1_POSITION                equ 0005h
RXFBCON7_F15BP_1_SIZE                    equ 0001h
RXFBCON7_F15BP_1_LENGTH                  equ 0001h
RXFBCON7_F15BP_1_MASK                    equ 0020h
RXFBCON7_F15BP_2_POSN                    equ 0006h
RXFBCON7_F15BP_2_POSITION                equ 0006h
RXFBCON7_F15BP_2_SIZE                    equ 0001h
RXFBCON7_F15BP_2_LENGTH                  equ 0001h
RXFBCON7_F15BP_2_MASK                    equ 0040h
RXFBCON7_F15BP_3_POSN                    equ 0007h
RXFBCON7_F15BP_3_POSITION                equ 0007h
RXFBCON7_F15BP_3_SIZE                    equ 0001h
RXFBCON7_F15BP_3_LENGTH                  equ 0001h
RXFBCON7_F15BP_3_MASK                    equ 0080h
RXFBCON7_F14BP_01_POSN                   equ 0000h
RXFBCON7_F14BP_01_POSITION               equ 0000h
RXFBCON7_F14BP_01_SIZE                   equ 0001h
RXFBCON7_F14BP_01_LENGTH                 equ 0001h
RXFBCON7_F14BP_01_MASK                   equ 0001h

// Register: MSEL0
#define MSEL0 MSEL0
MSEL0                                    equ 0E79h
// bitfield definitions
MSEL0_FIL0_POSN                          equ 0000h
MSEL0_FIL0_POSITION                      equ 0000h
MSEL0_FIL0_SIZE                          equ 0002h
MSEL0_FIL0_LENGTH                        equ 0002h
MSEL0_FIL0_MASK                          equ 0003h
MSEL0_FIL1_POSN                          equ 0002h
MSEL0_FIL1_POSITION                      equ 0002h
MSEL0_FIL1_SIZE                          equ 0002h
MSEL0_FIL1_LENGTH                        equ 0002h
MSEL0_FIL1_MASK                          equ 000Ch
MSEL0_FIL2_POSN                          equ 0004h
MSEL0_FIL2_POSITION                      equ 0004h
MSEL0_FIL2_SIZE                          equ 0002h
MSEL0_FIL2_LENGTH                        equ 0002h
MSEL0_FIL2_MASK                          equ 0030h
MSEL0_FIL3_POSN                          equ 0006h
MSEL0_FIL3_POSITION                      equ 0006h
MSEL0_FIL3_SIZE                          equ 0002h
MSEL0_FIL3_LENGTH                        equ 0002h
MSEL0_FIL3_MASK                          equ 00C0h
MSEL0_FIL0_0_POSN                        equ 0000h
MSEL0_FIL0_0_POSITION                    equ 0000h
MSEL0_FIL0_0_SIZE                        equ 0001h
MSEL0_FIL0_0_LENGTH                      equ 0001h
MSEL0_FIL0_0_MASK                        equ 0001h
MSEL0_FIL0_1_POSN                        equ 0001h
MSEL0_FIL0_1_POSITION                    equ 0001h
MSEL0_FIL0_1_SIZE                        equ 0001h
MSEL0_FIL0_1_LENGTH                      equ 0001h
MSEL0_FIL0_1_MASK                        equ 0002h
MSEL0_FIL1_0_POSN                        equ 0002h
MSEL0_FIL1_0_POSITION                    equ 0002h
MSEL0_FIL1_0_SIZE                        equ 0001h
MSEL0_FIL1_0_LENGTH                      equ 0001h
MSEL0_FIL1_0_MASK                        equ 0004h
MSEL0_FIL1_1_POSN                        equ 0003h
MSEL0_FIL1_1_POSITION                    equ 0003h
MSEL0_FIL1_1_SIZE                        equ 0001h
MSEL0_FIL1_1_LENGTH                      equ 0001h
MSEL0_FIL1_1_MASK                        equ 0008h
MSEL0_FIL2_0_POSN                        equ 0004h
MSEL0_FIL2_0_POSITION                    equ 0004h
MSEL0_FIL2_0_SIZE                        equ 0001h
MSEL0_FIL2_0_LENGTH                      equ 0001h
MSEL0_FIL2_0_MASK                        equ 0010h
MSEL0_FIL2_1_POSN                        equ 0005h
MSEL0_FIL2_1_POSITION                    equ 0005h
MSEL0_FIL2_1_SIZE                        equ 0001h
MSEL0_FIL2_1_LENGTH                      equ 0001h
MSEL0_FIL2_1_MASK                        equ 0020h
MSEL0_FIL3_0_POSN                        equ 0006h
MSEL0_FIL3_0_POSITION                    equ 0006h
MSEL0_FIL3_0_SIZE                        equ 0001h
MSEL0_FIL3_0_LENGTH                      equ 0001h
MSEL0_FIL3_0_MASK                        equ 0040h
MSEL0_FIL3_1_POSN                        equ 0007h
MSEL0_FIL3_1_POSITION                    equ 0007h
MSEL0_FIL3_1_SIZE                        equ 0001h
MSEL0_FIL3_1_LENGTH                      equ 0001h
MSEL0_FIL3_1_MASK                        equ 0080h

