GopalSaraf/Practicals/PSDL/include/proc/pic18f45k80.inc
#define TXB0EID8                         BANKMASK(TXB0EIDH), 0, b
#define TXB0EID9                         BANKMASK(TXB0EIDH), 1, b
#define TXB0ERR                          BANKMASK(TXB0CON), 4, b
#define TXB0EXIDE                        BANKMASK(TXB0SIDL), 3, b
#define TXB0IF                           BANKMASK(PIR5), 2, a
#define TXB0IP                           BANKMASK(IPR5), 2, a
#define TXB0LARB                         BANKMASK(TXB0CON), 5, b
#define TXB0PRI0                         BANKMASK(TXB0CON), 0, b
#define TXB0PRI1                         BANKMASK(TXB0CON), 1, b
#define TXB0REQ                          BANKMASK(TXB0CON), 3, b
#define TXB0RTR                          BANKMASK(TXB0DLC), 6, b
#define TXB0SID0                         BANKMASK(TXB0SIDL), 5, b
#define TXB0SID1                         BANKMASK(TXB0SIDL), 6, b
#define TXB0SID10                        BANKMASK(TXB0SIDH), 7, b
#define TXB0SID2                         BANKMASK(TXB0SIDL), 7, b
#define TXB0SID3                         BANKMASK(TXB0SIDH), 0, b
#define TXB0SID4                         BANKMASK(TXB0SIDH), 1, b
#define TXB0SID5                         BANKMASK(TXB0SIDH), 2, b
#define TXB0SID6                         BANKMASK(TXB0SIDH), 3, b
#define TXB0SID7                         BANKMASK(TXB0SIDH), 4, b
#define TXB0SID8                         BANKMASK(TXB0SIDH), 5, b
#define TXB0SID9                         BANKMASK(TXB0SIDH), 6, b
#define TXB1ABT                          BANKMASK(TXB1CON), 6, b
#define TXB1D00                          BANKMASK(TXB1D0), 0, b
#define TXB1D01                          BANKMASK(TXB1D0), 1, b
#define TXB1D02                          BANKMASK(TXB1D0), 2, b
#define TXB1D03                          BANKMASK(TXB1D0), 3, b
#define TXB1D04                          BANKMASK(TXB1D0), 4, b
#define TXB1D05                          BANKMASK(TXB1D0), 5, b
#define TXB1D06                          BANKMASK(TXB1D0), 6, b
#define TXB1D07                          BANKMASK(TXB1D0), 7, b
#define TXB1D10                          BANKMASK(TXB1D1), 0, b
#define TXB1D11                          BANKMASK(TXB1D1), 1, b
#define TXB1D12                          BANKMASK(TXB1D1), 2, b
#define TXB1D13                          BANKMASK(TXB1D1), 3, b
#define TXB1D14                          BANKMASK(TXB1D1), 4, b
#define TXB1D15                          BANKMASK(TXB1D1), 5, b
#define TXB1D16                          BANKMASK(TXB1D1), 6, b
#define TXB1D17                          BANKMASK(TXB1D1), 7, b
#define TXB1D20                          BANKMASK(TXB1D2), 0, b
#define TXB1D21                          BANKMASK(TXB1D2), 1, b
#define TXB1D22                          BANKMASK(TXB1D2), 2, b
#define TXB1D23                          BANKMASK(TXB1D2), 3, b
#define TXB1D24                          BANKMASK(TXB1D2), 4, b
#define TXB1D25                          BANKMASK(TXB1D2), 5, b
#define TXB1D26                          BANKMASK(TXB1D2), 6, b
#define TXB1D27                          BANKMASK(TXB1D2), 7, b
#define TXB1D30                          BANKMASK(TXB1D3), 0, b
#define TXB1D31                          BANKMASK(TXB1D3), 1, b
#define TXB1D32                          BANKMASK(TXB1D3), 2, b
#define TXB1D33                          BANKMASK(TXB1D3), 3, b
#define TXB1D34                          BANKMASK(TXB1D3), 4, b
#define TXB1D35                          BANKMASK(TXB1D3), 5, b
#define TXB1D36                          BANKMASK(TXB1D3), 6, b
#define TXB1D37                          BANKMASK(TXB1D3), 7, b
#define TXB1D40                          BANKMASK(TXB1D4), 0, b
#define TXB1D41                          BANKMASK(TXB1D4), 1, b
#define TXB1D42                          BANKMASK(TXB1D4), 2, b
#define TXB1D43                          BANKMASK(TXB1D4), 3, b
#define TXB1D44                          BANKMASK(TXB1D4), 4, b
#define TXB1D45                          BANKMASK(TXB1D4), 5, b
#define TXB1D46                          BANKMASK(TXB1D4), 6, b
#define TXB1D47                          BANKMASK(TXB1D4), 7, b
#define TXB1D50                          BANKMASK(TXB1D5), 0, b
#define TXB1D51                          BANKMASK(TXB1D5), 1, b
#define TXB1D52                          BANKMASK(TXB1D5), 2, b
#define TXB1D53                          BANKMASK(TXB1D5), 3, b
#define TXB1D54                          BANKMASK(TXB1D5), 4, b
#define TXB1D55                          BANKMASK(TXB1D5), 5, b
#define TXB1D56                          BANKMASK(TXB1D5), 6, b
#define TXB1D57                          BANKMASK(TXB1D5), 7, b
#define TXB1D60                          BANKMASK(TXB1D6), 0, b
#define TXB1D61                          BANKMASK(TXB1D6), 1, b
#define TXB1D62                          BANKMASK(TXB1D6), 2, b
#define TXB1D63                          BANKMASK(TXB1D6), 3, b
#define TXB1D64                          BANKMASK(TXB1D6), 4, b
#define TXB1D65                          BANKMASK(TXB1D6), 5, b
#define TXB1D66                          BANKMASK(TXB1D6), 6, b
#define TXB1D67                          BANKMASK(TXB1D6), 7, b
#define TXB1D70                          BANKMASK(TXB1D7), 0, b
#define TXB1D71                          BANKMASK(TXB1D7), 1, b
#define TXB1D72                          BANKMASK(TXB1D7), 2, b
#define TXB1D73                          BANKMASK(TXB1D7), 3, b
#define TXB1D74                          BANKMASK(TXB1D7), 4, b
#define TXB1D75                          BANKMASK(TXB1D7), 5, b
#define TXB1D76                          BANKMASK(TXB1D7), 6, b
#define TXB1D77                          BANKMASK(TXB1D7), 7, b
#define TXB1DLC0                         BANKMASK(TXB1DLC), 0, b
#define TXB1DLC1                         BANKMASK(TXB1DLC), 1, b
#define TXB1DLC2                         BANKMASK(TXB1DLC), 2, b
#define TXB1DLC3                         BANKMASK(TXB1DLC), 3, b
#define TXB1EID0                         BANKMASK(TXB1EIDL), 0, b
#define TXB1EID1                         BANKMASK(TXB1EIDL), 1, b
#define TXB1EID10                        BANKMASK(TXB1EIDH), 2, b
#define TXB1EID11                        BANKMASK(TXB1EIDH), 3, b
#define TXB1EID12                        BANKMASK(TXB1EIDH), 4, b
#define TXB1EID13                        BANKMASK(TXB1EIDH), 5, b
#define TXB1EID14                        BANKMASK(TXB1EIDH), 6, b
#define TXB1EID15                        BANKMASK(TXB1EIDH), 7, b
#define TXB1EID16                        BANKMASK(TXB1SIDL), 0, b
#define TXB1EID17                        BANKMASK(TXB1SIDL), 1, b
#define TXB1EID2                         BANKMASK(TXB1EIDL), 2, b
#define TXB1EID3                         BANKMASK(TXB1EIDL), 3, b
#define TXB1EID4                         BANKMASK(TXB1EIDL), 4, b
#define TXB1EID5                         BANKMASK(TXB1EIDL), 5, b
#define TXB1EID6                         BANKMASK(TXB1EIDL), 6, b
#define TXB1EID7                         BANKMASK(TXB1EIDL), 7, b
#define TXB1EID8                         BANKMASK(TXB1EIDH), 0, b
#define TXB1EID9                         BANKMASK(TXB1EIDH), 1, b
#define TXB1ERR                          BANKMASK(TXB1CON), 4, b
#define TXB1EXIDE                        BANKMASK(TXB1SIDL), 3, b
#define TXB1IF                           BANKMASK(PIR5), 3, a
#define TXB1IP                           BANKMASK(IPR5), 3, a
#define TXB1LARB                         BANKMASK(TXB1CON), 5, b
#define TXB1PRI0                         BANKMASK(TXB1CON), 0, b
#define TXB1PRI1                         BANKMASK(TXB1CON), 1, b
#define TXB1REQ                          BANKMASK(TXB1CON), 3, b
#define TXB1RTR                          BANKMASK(TXB1DLC), 6, b
#define TXB1SID0                         BANKMASK(TXB1SIDL), 5, b
#define TXB1SID1                         BANKMASK(TXB1SIDL), 6, b
#define TXB1SID10                        BANKMASK(TXB1SIDH), 7, b
#define TXB1SID2                         BANKMASK(TXB1SIDL), 7, b
#define TXB1SID3                         BANKMASK(TXB1SIDH), 0, b
#define TXB1SID4                         BANKMASK(TXB1SIDH), 1, b
#define TXB1SID5                         BANKMASK(TXB1SIDH), 2, b
#define TXB1SID6                         BANKMASK(TXB1SIDH), 3, b
#define TXB1SID7                         BANKMASK(TXB1SIDH), 4, b
#define TXB1SID8                         BANKMASK(TXB1SIDH), 5, b
#define TXB1SID9                         BANKMASK(TXB1SIDH), 6, b
#define TXB2ABT                          BANKMASK(TXB2CON), 6, b
#define TXB2D00                          BANKMASK(TXB2D0), 0, b
#define TXB2D01                          BANKMASK(TXB2D0), 1, b
#define TXB2D02                          BANKMASK(TXB2D0), 2, b
#define TXB2D03                          BANKMASK(TXB2D0), 3, b
#define TXB2D04                          BANKMASK(TXB2D0), 4, b
#define TXB2D05                          BANKMASK(TXB2D0), 5, b
#define TXB2D06                          BANKMASK(TXB2D0), 6, b
#define TXB2D07                          BANKMASK(TXB2D0), 7, b
#define TXB2D10                          BANKMASK(TXB2D1), 0, b
#define TXB2D11                          BANKMASK(TXB2D1), 1, b
#define TXB2D12                          BANKMASK(TXB2D1), 2, b
#define TXB2D13                          BANKMASK(TXB2D1), 3, b
#define TXB2D14                          BANKMASK(TXB2D1), 4, b
#define TXB2D15                          BANKMASK(TXB2D1), 5, b
#define TXB2D16                          BANKMASK(TXB2D1), 6, b
#define TXB2D17                          BANKMASK(TXB2D1), 7, b
#define TXB2D20                          BANKMASK(TXB2D2), 0, b
#define TXB2D21                          BANKMASK(TXB2D2), 1, b
#define TXB2D22                          BANKMASK(TXB2D2), 2, b
#define TXB2D23                          BANKMASK(TXB2D2), 3, b
#define TXB2D24                          BANKMASK(TXB2D2), 4, b
#define TXB2D25                          BANKMASK(TXB2D2), 5, b
#define TXB2D26                          BANKMASK(TXB2D2), 6, b
#define TXB2D27                          BANKMASK(TXB2D2), 7, b
#define TXB2D30                          BANKMASK(TXB2D3), 0, b
#define TXB2D31                          BANKMASK(TXB2D3), 1, b
#define TXB2D32                          BANKMASK(TXB2D3), 2, b
#define TXB2D33                          BANKMASK(TXB2D3), 3, b
#define TXB2D34                          BANKMASK(TXB2D3), 4, b
#define TXB2D35                          BANKMASK(TXB2D3), 5, b
#define TXB2D36                          BANKMASK(TXB2D3), 6, b
#define TXB2D37                          BANKMASK(TXB2D3), 7, b
#define TXB2D40                          BANKMASK(TXB2D4), 0, b
#define TXB2D41                          BANKMASK(TXB2D4), 1, b
#define TXB2D42                          BANKMASK(TXB2D4), 2, b
#define TXB2D43                          BANKMASK(TXB2D4), 3, b
#define TXB2D44                          BANKMASK(TXB2D4), 4, b
#define TXB2D45                          BANKMASK(TXB2D4), 5, b
#define TXB2D46                          BANKMASK(TXB2D4), 6, b
#define TXB2D47                          BANKMASK(TXB2D4), 7, b
#define TXB2D50                          BANKMASK(TXB2D5), 0, b
#define TXB2D51                          BANKMASK(TXB2D5), 1, b
#define TXB2D52                          BANKMASK(TXB2D5), 2, b
#define TXB2D53                          BANKMASK(TXB2D5), 3, b
#define TXB2D54                          BANKMASK(TXB2D5), 4, b
#define TXB2D55                          BANKMASK(TXB2D5), 5, b
#define TXB2D56                          BANKMASK(TXB2D5), 6, b
#define TXB2D57                          BANKMASK(TXB2D5), 7, b
#define TXB2D60                          BANKMASK(TXB2D6), 0, b
#define TXB2D61                          BANKMASK(TXB2D6), 1, b
#define TXB2D62                          BANKMASK(TXB2D6), 2, b
#define TXB2D63                          BANKMASK(TXB2D6), 3, b
#define TXB2D64                          BANKMASK(TXB2D6), 4, b
#define TXB2D65                          BANKMASK(TXB2D6), 5, b
#define TXB2D66                          BANKMASK(TXB2D6), 6, b
#define TXB2D67                          BANKMASK(TXB2D6), 7, b
#define TXB2D70                          BANKMASK(TXB2D7), 0, b
#define TXB2D71                          BANKMASK(TXB2D7), 1, b
#define TXB2D72                          BANKMASK(TXB2D7), 2, b
#define TXB2D73                          BANKMASK(TXB2D7), 3, b
#define TXB2D74                          BANKMASK(TXB2D7), 4, b
#define TXB2D75                          BANKMASK(TXB2D7), 5, b
#define TXB2D76                          BANKMASK(TXB2D7), 6, b
#define TXB2D77                          BANKMASK(TXB2D7), 7, b
#define TXB2DLC0                         BANKMASK(TXB2DLC), 0, b
#define TXB2DLC1                         BANKMASK(TXB2DLC), 1, b
#define TXB2DLC2                         BANKMASK(TXB2DLC), 2, b
#define TXB2DLC3                         BANKMASK(TXB2DLC), 3, b
#define TXB2EID0                         BANKMASK(TXB2EIDL), 0, b
#define TXB2EID1                         BANKMASK(TXB2EIDL), 1, b
#define TXB2EID10                        BANKMASK(TXB2EIDH), 2, b
#define TXB2EID11                        BANKMASK(TXB2EIDH), 3, b
#define TXB2EID12                        BANKMASK(TXB2EIDH), 4, b
#define TXB2EID13                        BANKMASK(TXB2EIDH), 5, b
#define TXB2EID14                        BANKMASK(TXB2EIDH), 6, b
#define TXB2EID15                        BANKMASK(TXB2EIDH), 7, b
#define TXB2EID16                        BANKMASK(TXB2SIDL), 0, b
#define TXB2EID17                        BANKMASK(TXB2SIDL), 1, b
#define TXB2EID2                         BANKMASK(TXB2EIDL), 2, b
#define TXB2EID3                         BANKMASK(TXB2EIDL), 3, b
#define TXB2EID4                         BANKMASK(TXB2EIDL), 4, b
#define TXB2EID5                         BANKMASK(TXB2EIDL), 5, b
#define TXB2EID6                         BANKMASK(TXB2EIDL), 6, b
#define TXB2EID7                         BANKMASK(TXB2EIDL), 7, b
#define TXB2EID8                         BANKMASK(TXB2EIDH), 0, b
#define TXB2EID9                         BANKMASK(TXB2EIDH), 1, b
#define TXB2ERR                          BANKMASK(TXB2CON), 4, b
#define TXB2EXIDE                        BANKMASK(TXB2SIDL), 3, b
#define TXB2IF                           BANKMASK(PIR5), 4, a
#define TXB2IP                           BANKMASK(IPR5), 4, a
#define TXB2LARB                         BANKMASK(TXB2CON), 5, b
#define TXB2PRI0                         BANKMASK(TXB2CON), 0, b
#define TXB2PRI1                         BANKMASK(TXB2CON), 1, b
#define TXB2REQ                          BANKMASK(TXB2CON), 3, b
#define TXB2RTR                          BANKMASK(TXB2DLC), 6, b
#define TXB2SID0                         BANKMASK(TXB2SIDL), 5, b
#define TXB2SID1                         BANKMASK(TXB2SIDL), 6, b
#define TXB2SID10                        BANKMASK(TXB2SIDH), 7, b
#define TXB2SID2                         BANKMASK(TXB2SIDL), 7, b
#define TXB2SID3                         BANKMASK(TXB2SIDH), 0, b
#define TXB2SID4                         BANKMASK(TXB2SIDH), 1, b
#define TXB2SID5                         BANKMASK(TXB2SIDH), 2, b
#define TXB2SID6                         BANKMASK(TXB2SIDH), 3, b
#define TXB2SID7                         BANKMASK(TXB2SIDH), 4, b
#define TXB2SID8                         BANKMASK(TXB2SIDH), 5, b
#define TXB2SID9                         BANKMASK(TXB2SIDH), 6, b
#define TXBNIE                           BANKMASK(PIE3), 4, a
#define TXBNIF                           BANKMASK(PIR3), 4, a
#define TXBNIP                           BANKMASK(IPR3), 4, a
#define TXBO                             BANKMASK(COMSTAT), 5, a
#define TXBP                             BANKMASK(COMSTAT), 4, a
#define TXBnIE                           BANKMASK(PIE5), 4, a
#define TXBnIF                           BANKMASK(PIR5), 4, a
#define TXBnIP                           BANKMASK(IPR5), 4, a
#define TXCKP1                           BANKMASK(BAUDCON1), 4, a
#define TXCKP2                           BANKMASK(BAUDCON2), 4, a
#define TXD8                             BANKMASK(TXSTA1), 0, a
#define TXD82                            BANKMASK(TXSTA2), 0, a
#define TXEN1                            BANKMASK(TXSTA1), 5, a
#define TXEN2                            BANKMASK(TXSTA2), 5, a
#define TXIE                             BANKMASK(PIE1), 4, a
#define TXIF                             BANKMASK(PIR1), 4, a
#define TXIP                             BANKMASK(IPR1), 4, a
#define TXWARN                           BANKMASK(COMSTAT), 2, a
#define U1OD                             BANKMASK(ODCON), 0, a
#define U2OD                             BANKMASK(ODCON), 1, a
#define UA                               BANKMASK(SSPSTAT), 1, a
#define UART1MD                          BANKMASK(PMD0), 1, b
#define UART2MD                          BANKMASK(PMD0), 2, b
#define ULPEN                            BANKMASK(WDTCON), 2, a
#define ULPLVL                           BANKMASK(WDTCON), 5, a
#define ULPSINK                          BANKMASK(WDTCON), 1, a
#define ULPWUIN                          BANKMASK(PORTA), 0, a
#define VCFG0                            BANKMASK(ADCON1), 4, a
#define VCFG01                           BANKMASK(ADCON1), 4, a
#define VCFG1                            BANKMASK(ADCON1), 5, a
#define VCFG11                           BANKMASK(ADCON1), 5, a
#define VDIRMAG                          BANKMASK(HLVDCON), 7, a
#define VNCFG                            BANKMASK(ADCON1), 3, a
#define WAIT0                            BANKMASK(PR2), 4, a
#define WAIT1                            BANKMASK(PR2), 5, a
#define WAKDIS                           BANKMASK(BRGCON3), 7, b
#define WAKFIL                           BANKMASK(BRGCON3), 6, b
#define WAKIE                            BANKMASK(PIE5), 6, a
#define WAKIF                            BANKMASK(PIR5), 6, a
#define WAKIP                            BANKMASK(IPR5), 6, a
#define WCOL                             BANKMASK(SSPCON1), 7, a
#define WM0                              BANKMASK(PR2), 0, a
#define WM1                              BANKMASK(PR2), 1, a
#define WPUB0                            BANKMASK(WPUB), 0, b
#define WPUB1                            BANKMASK(WPUB), 1, b
#define WPUB2                            BANKMASK(WPUB), 2, b
#define WPUB3                            BANKMASK(WPUB), 3, b
#define WPUB4                            BANKMASK(WPUB), 4, b
#define WPUB5                            BANKMASK(WPUB), 5, b
#define WPUB6                            BANKMASK(WPUB), 6, b
#define WPUB7                            BANKMASK(WPUB), 7, b
#define WR                               BANKMASK(EECON1), 1, a
#define WRE                              BANKMASK(PORTE), 1, a
#define WREN                             BANKMASK(EECON1), 2, a
#define WRERR                            BANKMASK(EECON1), 3, a
#define WUE1                             BANKMASK(BAUDCON1), 1, a
#define WUE2                             BANKMASK(BAUDCON2), 1, a
#define ZERO                             BANKMASK(STATUS), 2, a
#define nA                               BANKMASK(SSPSTAT), 5, a
#define nADDRESS                         BANKMASK(SSPSTAT), 5, a
#define nBOR                             BANKMASK(RCON), 0, a
#define nCM                              BANKMASK(RCON), 5, a
#define nDONE                            BANKMASK(ADCON0), 1, a
#define nFIFOEMPTY                       BANKMASK(COMSTAT), 7, a
#define nPD                              BANKMASK(RCON), 2, a
#define nPOR                             BANKMASK(RCON), 1, a
#define nRBPU                            BANKMASK(INTCON2), 7, a
#define nRC8                             BANKMASK(RCSTA1), 6, a
#define nRI                              BANKMASK(RCON), 4, a
#define nT1DONE                          BANKMASK(T1GCON), 3, a
#define nT1SYNC                          BANKMASK(T1CON), 2, a
#define nT3DONE                          BANKMASK(T3GCON), 3, a
#define nT3SYNC                          BANKMASK(T3CON), 2, a
#define nTO                              BANKMASK(RCON), 3, a
#define nTX8                             BANKMASK(TXSTA1), 6, a
#define nW                               BANKMASK(SSPSTAT), 2, a
#define nWRITE                           BANKMASK(SSPSTAT), 2, a

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

#if _COMMON_SIZE_
psect udata_acs,class=COMRAM,space=SPACE_DATA,noexec,lowdata
#endif
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec,lowdata
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec,lowdata
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec,lowdata
psect udata_bank3,class=BANK3,space=SPACE_DATA,noexec,lowdata
psect udata_bank4,class=BANK4,space=SPACE_DATA,noexec,lowdata
psect udata_bank5,class=BANK5,space=SPACE_DATA,noexec,lowdata
psect udata_bank6,class=BANK6,space=SPACE_DATA,noexec,lowdata
psect udata_bank7,class=BANK7,space=SPACE_DATA,noexec,lowdata
psect udata_bank8,class=BANK8,space=SPACE_DATA,noexec,lowdata
psect udata_bank9,class=BANK9,space=SPACE_DATA,noexec,lowdata
psect udata_bank10,class=BANK10,space=SPACE_DATA,noexec,lowdata
psect udata_bank11,class=BANK11,space=SPACE_DATA,noexec,lowdata
psect udata_bank12,class=BANK12,space=SPACE_DATA,noexec,lowdata
psect udata_bank13,class=BANK13,space=SPACE_DATA,noexec,lowdata
psect udata_bank14,class=BANK14,space=SPACE_DATA,noexec,lowdata
psect udata,class=RAM,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,reloc=2
psect data,class=CONST,space=SPACE_CODE,reloc=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=1,noexec

#endif // _XC_INC_

#endif // _PIC18F45K80_INC_
